app/Controllers/CajasController.php

SELECT *
FROM `cajas`
---
    public function cajas()
    {
        $cajas = new CajasModel();
        $resultadocajas['resultadocajas']=$cajas->findAll();