app/Controllers/CategoriasController.php

    public function categoria()
    {
        $categorias = new CategoriasModel();
        $resultadocategorias['resultadocategorias']=$categorias->findAll();
---
SELECT *
FROM `categorias`

    public function localizar($codigo=null){

      $categorias = new CategoriasModel();
      $data['data']=$categorias ->where('id',$codigo)->first();
---
SELECT *
FROM `categorias`
WHERE `id` = '1'
 LIMIT 1