app/Controllers/ClientesController.php

SELECT *
FROM `clientes`
---
    public function clientes()
    {
        $clientes = new ClientesModel();
        $resultadoclientes['resultadoclientes']=$clientes->findAll();

SELECT *
FROM `clientes`
WHERE `id` = '1'
 LIMIT 1
---
    public function localizar($codigo=null){

      $clientes = new ClientesModel();
      $data['data']=$clientes ->where('id',$codigo)->first();