app/Controllers/ConfiguracionController.php

    public function configuracion($codigo=1)
    {
        $configuracion = new ConfiguracionModel();
        $data['data']=$configuracion ->where('id',$codigo)->first();
---
SELECT *
FROM `configuracion`
WHERE `id` = 1
 LIMIT 1