app/Controllers/ProductosController.php

SELECT *
FROM `productos`
SELECT *
FROM `categorias`
---
    public function producto()

    {
        $productos = new ProductosModel();
        $resultadop=$productos->findAll();
        $categorias = new CategoriasModel();
        $resultadoc=$categorias->findAll();