app/Controllers/RolesController.php

    public function roles()
    {
        $roles = new RolesModel();
        $resultadoroles['resultadoroles']=$roles->findAll();
---
SELECT *
FROM `roles`