app/Controllers/UnidadesController.php

    public function unidades()
    {
        $unidades = new UnidadesModel();
        $resultadounidades['resultadounidades']=$unidades->findAll();
---
SELECT *
FROM `unidades`

      public function localizar($codigo=null){

        $unidades = new UnidadesModel();
        $data['data']=$unidades ->where('id',$codigo)->first();
---
SELECT *
FROM `unidades`
WHERE `id` = '1'
 LIMIT 1