app/Controllers/UsuariosController.php

SELECT *
FROM `usuarios`
---
    public function usuarios()
    {
        $usuarios = new UsuariosModel();
        $resultadousuarios['resultadousuarios']=$usuarios->findAll();

SELECT *
FROM `usuarios`
WHERE `id` = '3'
 LIMIT 1
---
      public function localizar($codigo=null){

        $usuarios = new UsuariosModel();
        $data['data']=$usuarios ->where('id',$codigo)->first();